Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
    // Configure USART2 Tx (PA.02) as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
    // Enable the USART2 Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);    
	
	USART_DeInit(USART2);
    
    USART_InitStructure.USART_BaudRate = bound;                
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; 
    
    USART_Init(USART2, &USART_InitStructure);
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
    // Enable USART2
    USART_Cmd(USART2, ENABLE);
	*/
}

volatile void xUSART2_IRQHandler(void)
{	
	static uint32_t Index = 0;
	static uint16_t u16PackSize = 0;
	static uint32_t IPDState = IPD_STATE_START_PROBE;
	// static uint32_t 
	static uint16_t num = 0;
	static uint8_t i = 0;
	static uint16_t FirstComma = 0, SecondComma = 0, Colon = 0;
	static uint16_t RxData=0;
	static uint16_t u16SocketID = 0;
	static sint32_t u32CurrentSockId = -1;
	uint32_t u32Tmp = 0;
	
	if(USART_GetITStatus(USART1, USART_IT_RXNE) == RESET) {
		return;
	}
	
	RxData = USART_RECEIVE(USART_WIFI, RxData);
	
	if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_RUNNING) {
		usart_wifi_buf[Index++] = (uint8_t)RxData;
		if(Index >= WIFI_BUF_SIZE - 1) {
			// StartReceiveFlag = 0;
			// SET_WIFI_USART_STATE(WIFI_MSG_FLAG_BUF_OVERFLOW);
			IPDState = IPD_STATE_START_PROBE;
			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
			Index = 0;
			return;
		}
		// IPD PACKET
		switch(IPDState) {
			case IPD_STATE_START_PROBE:
				if('+' == usart_wifi_buf[0]) {
					IPDState = IPD_STATE_HANDLE_HEADER;
				}
				break;
				// Not return, 
				// because we don't know whether it's an another packet type
			case IPD_STATE_HANDLE_HEADER:
				if( Index >= 4) {
					if (usart_wifi_buf[0] == '+' && 
						usart_wifi_buf[1] == 'I' && 
						usart_wifi_buf[2] == 'P' && 
						usart_wifi_buf[3] == 'D' 	) {
							IPDState = IPD_STATE_HANDLE_SOCKET_ID;
						} else {
							IPDState = IPD_STATE_START_PROBE;
						}
				}
				// Not return, 
				// because we don't know whether it's an another packet type
				break;
			case IPD_STATE_HANDLE_SOCKET_ID:
				if(Index <= 4) {
					// retrive the previous state
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				FirstComma = 0;
				SecondComma = 0;
				for(i = 4; i < Index; i++) {
					if(',' == usart_wifi_buf[i] && 0 == FirstComma) {
						FirstComma = i;
					}
					else if(',' == usart_wifi_buf[i] && FirstComma != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == FirstComma || 0 == SecondComma) {
					return;
				}
				u32Tmp = SecondComma-FirstComma-1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)usart_wifi_buf[FirstComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp < 0 || u32Tmp > 4) {
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				// u16SocketID = u32Tmp;
				u32CurrentSockId = u32Tmp;
				IPDState = IPD_STATE_HANDLE_SIZE;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_SIZE:
				Colon = 0;
				SecondComma = 0;
				for(i = Index - 1; i > 4; i--) {
					if(';' == usart_wifi_buf[i] && 0 == Colon) {
						Colon = i;
					}
					else if(',' == usart_wifi_buf[i] && Colon != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == Colon || 0 == SecondComma) {
					return;
				}
				u32Tmp = Colon - SecondComma - 1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)&usart_wifi_buf[SecondComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp > 5000) {  // max msg size 5000(temporarily 5000)
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				u16PackSize = u32Tmp;
				IPDState = IPD_STATE_HANDLE_CONTENT;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_CONTENT:
				if(Index > Colon + u16PackSize) {
					IPDState = IPD_STATE_COMPLETED;
				} else {
					return;
					break; // never come here
				}
				// no break here
			case IPD_STATE_COMPLETED:
				// TODO:
				// handle \r\n left;
				if(u16PackSize > SOCKET_BUF_SIZE) {
					IPDState = IPD_STATE_START_PROBE;
				} else if(u16SocketID > 4) {
					IPDState = IPD_STATE_START_PROBE;
				} else {
					if(usart_wifi_buf[Index-1] == '\n' && usart_wifi_buf[Index-2] == '\r') {
						memcpy(sock_data[u32CurrentSockId].buf, &usart_wifi_buf[Colon+1], u16PackSize);
						IPDState = IPD_STATE_START_PROBE;
					}
				}
				
				return;
			default:
				IPDState = IPD_STATE_START_PROBE;
				break;
		}
		
		// client connects to local server
		if(Index >= 1) {
			if(isdigit(usart_wifi_buf[0])) {
				u32CurrentSockId = BC_Atoi(usart_wifi_buf[0]);
				if(Index >= WIFI_MSG_CONNECT_TERMINATOR_SIZE) {
					if( usart_wifi_buf[Index-1] == '\n'	&& 
						usart_wifi_buf[Index-2] == '\r'	&&
						usart_wifi_buf[Index-3] == 'T' 	&&
						usart_wifi_buf[Index-4] == 'C' 	&&
						usart_wifi_buf[Index-5] == 'E' 	&&	
						usart_wifi_buf[Index-6] == 'N' 	&&
						usart_wifi_buf[Index-7] == 'N' 	&&
						usart_wifi_buf[Index-8] == 'O' 	&&
						usart_wifi_buf[Index-9] == 'C' 	) {
							sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CONNECT;
							return;
						}							
				}
				if(Index >= WIFI_MSG_CLOSED_TERMINATOR_SIZE) {
					if( usart_wifi_buf[Index-1] == '\n'	&& 
						usart_wifi_buf[Index-2] == '\r'	&&
						usart_wifi_buf[Index-3] == 'D' 	&&
						usart_wifi_buf[Index-4] == 'E' 	&&	
						usart_wifi_buf[Index-5] == 'S' 	&&
						usart_wifi_buf[Index-6] == 'O' 	&&
						usart_wifi_buf[Index-7] == 'L' 	&&
						usart_wifi_buf[Index-8] == 'C' 	) {
							sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CLOSED;
							return;
						}							
				}
			}
		}
		if(Index >= 10) {
			if( usart_wifi_buf[Index-1] == 'S'	&& 
				usart_wifi_buf[Index-2] == 'U'	&&
				usart_wifi_buf[Index-3] == 'T' 	&&
				usart_wifi_buf[Index-4] == 'A' 	&&
				usart_wifi_buf[Index-5] == 'T' 	&&	
				usart_wifi_buf[Index-6] == 'S' 	&&
				usart_wifi_buf[Index-7] == 'P' 	&&
				usart_wifi_buf[Index-8] == 'I' 	&&
				usart_wifi_buf[Index-9] == 'C' 	&& 
				usart_wifi_buf[Index-10] =='+' 	) {
				}	
		}
		// END TERMINAL PACKET
		if(Index >= WIFI_MSG_OK_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'K' 	&&
				usart_wifi_buf[Index-4] == 'O' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
					Index = 0;
					return;
			}
		}
		if(Index >= WIFI_MSG_ERR_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'R' 	&&
				usart_wifi_buf[Index-4] == 'O' 	&&
				usart_wifi_buf[Index-5] == 'R' 	&&
				usart_wifi_buf[Index-6] == 'R' 	&&
				usart_wifi_buf[Index-7] == 'E' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
					Index = 0;
					return;
			}
		}
	} else if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_INIT) {
		usart_wifi_buf[Index++] = (uint8_t)RxData;
		if(Index >= WIFI_BUF_SIZE - 1) {
			// StartReceiveFlag = 0;
			WifiRecvFlag |= WIFI_MSG_FLAG_BUF_OVERFLOW;
			IPDState = IPD_STATE_START_PROBE;
			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
			Index = 0;
			return;
		}
		WifiRecvFlag = 0;
		// END TERMINAL PACKET
		if(Index >= WIFI_MSG_OK_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'K' 	&&
				usart_wifi_buf[Index-4] == 'O' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
					Index = 0;
					return;
			}
		}
		if(Index >= WIFI_MSG_ERR_TERMINATOR_SIZE) {
			if( usart_wifi_buf[Index-1] == '\n'	&& 
				usart_wifi_buf[Index-2] == '\r'	&&
				usart_wifi_buf[Index-3] == 'R' 	&&
				usart_wifi_buf[Index-4] == 'O' 	&&
				usart_wifi_buf[Index-5] == 'R' 	&&
				usart_wifi_buf[Index-6] == 'R' 	&&
				usart_wifi_buf[Index-7] == 'E' 	) 
			{
					usart_wifi_buf[Index] = '\0';
					WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
					Index = 0;
					return;
			}
		}
		
