Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
	}
	return;
}

volatile void HardFault_Handler(void)
{
	sprintf(msg, "HardFault:%x\r\n", *HFSR);
	sprintf(msg+strlen(msg), "MemManage:%x\r\n", *MFSR);
	sprintf(msg+strlen(msg), "BusFault:%x\r\n", *BFSR);
	sprintf(msg+strlen(msg), "BFAR:%x\r\n", *BFAR);
	sprintf(msg+strlen(msg), "UsageFault:%x\r\n", *UFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void MemManage_Handler(void)
{

	sprintf(msg, "MemManage:%x\r\n", *MFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void BusFault_Handler(void)
{

	sprintf(msg, "BusFault:%x\r\n", *BFSR);
	sprintf(msg+strlen(msg), "BFAR:%x\r\n", *BFAR);
	uputs(USART1, msg);
	for(;;);
}

volatile void UsageFault_Handler(void)
{

	sprintf(msg, "UsageFault:%x\r\n", *UFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void vUARTInterruptHandler( void )
{
	uint16_t RxData = 0;
	if(USART_GetITStatus(USART1, USART_IT_RXNE) == RESET) {
		return;
	}
	USART_RECEIVE(USART1, RxData);
	xxx = (sint8_t)RxData;

	
	/*
	if(StartReceiveFlag) {
		RxData = USART_RECEIVE(USART_WIFI, RxData);
		usart_wifi_buf[Index++] = (uint8_t)RxData;
		if(Index >= WIFI_BUF_SIZE - 1) {
			StartReceiveFlag = 0;
			IPDState = IPD_STATE_START_PROBE;
			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
			Index = 0;
			return;
		}
		// OTHER COMMAND
		if(StartAcceptFlag) {
			if(Index >= sizeof("0,CONNECT") - 1) {
				if(strncmp(usart_wifi_buf, "0,CONNECT", sizeof("0,CONNECT")-1) == 0) {
					StartAcceptFlag = 0;
				}
			}
		}
		
		// IDP PACKET
		switch(IPDState) {
			case IPD_STATE_START_PROBE:
				if('+' == usart_wifi_buf[0]) {
					IPDState = IPD_STATE_HANDLE_HEADER;
				}
				break;
				// Not return, 
				// because we don't know whether it's an another packet type
			case IPD_STATE_HANDLE_HEADER:
				if( Index >= 4) {
					if (usart_wifi_buf[0] == '+' && 
						usart_wifi_buf[1] == 'I' && 
						usart_wifi_buf[2] == 'P' && 
						usart_wifi_buf[3] == 'D' 	) {
							IPDState = IPD_STATE_HANDLE_SOCKET_ID;
						} else {
							IPDState = IPD_STATE_START_PROBE;
						}
				}
				// Not return, 
				// because we don't know whether it's an another packet type
				break;
			case IPD_STATE_HANDLE_SOCKET_ID:
				if(Index <= 4) {
					// retrive the previous state
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				FirstComma = 0;
				SecondComma = 0;
				for(i = 4; i < Index; i++) {
					if(',' == usart_wifi_buf[i] && 0 == FirstComma) {
						FirstComma = i;
					}
					else if(',' == usart_wifi_buf[i] && FirstComma != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == FirstComma || 0 == SecondComma) {
					return;
				}
				u32Tmp = SecondComma-FirstComma-1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)usart_wifi_buf[FirstComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp < 0 || u32Tmp > 4) {
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				u16SocketID = u32Tmp;
				IPDState = IPD_STATE_HANDLE_SIZE;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_SIZE:
				Colon = 0;
				SecondComma = 0;
				for(i = Index - 1; i > 4; i--) {
					if(';' == usart_wifi_buf[i] && 0 == Colon) {
						Colon = i;
					}
					else if(',' == usart_wifi_buf[i] && Colon != 0) {
						SecondComma = i;
						break;
					}
				}
				if(0 == Colon || 0 == SecondComma) {
					return;
				}
				u32Tmp = Colon - SecondComma - 1; // number of digit
				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				memcpy((void *)IPDNum, (void *)&usart_wifi_buf[SecondComma+1], u32Tmp);
				IPDNum[u32Tmp] = '\0';
				u32Tmp = atoi(IPDNum);
				if(u32Tmp > 5000) {  // max msg size 5000(temporarily 5000)
					// out of range
					IPDState = IPD_STATE_START_PROBE;
					break;
				}
				u16PackSize = u32Tmp;
				IPDState = IPD_STATE_HANDLE_CONTENT;
				return;
				break; // never come here
			case IPD_STATE_HANDLE_CONTENT:
				if(Index > Colon + u16PackSize) {
					IPDState = IPD_STATE_COMPLETED;
				} else {
					return;
					break; // never come here
				}
				// no break here
			case IPD_STATE_COMPLETED:
				// TODO:
				// there maybe \r\n left;
				if(u16PackSize > SOCKET_BUF_SIZE) {
					// IPDState = IPD_STATE_START_PROBE;
				} else if(u16SocketID > 4) {
					// IPDState = IPD_STATE_START_PROBE;
				} else {
					memcpy(sock_data[u16SocketID].buf, &usart_wifi_buf[Colon+1], u16PackSize);
				}
				IPDState = IPD_STATE_START_PROBE;
				return;
			default:
				IPDState = IPD_STATE_START_PROBE;
				break;
		}

		// END TERMINAL PACKET
		if(Index > 2) {
			if( usart_wifi_buf[Index-1] == 'K' && 
				usart_wifi_buf[Index-2] == 'O'	) 
			{
					usart_wifi_buf[Index] = '\0';
					StartReceiveFlag = 0;
					Index = 0;
					return;
			}
		}
		if(Index > 5) {
			if( usart_wifi_buf[Index-1] == 'R' && 
				usart_wifi_buf[Index-2] == 'O' && 
				usart_wifi_buf[Index-3] == 'R' && 
				usart_wifi_buf[Index-4] == 'R' && 
				usart_wifi_buf[Index-5] == 'E' 	) {
					
					usart_wifi_buf[Index] = '\0';
					StartReceiveFlag = 0;
					Index = 0;
					return;
				}
		}
		
	} else
	{
		RxData = USART_RECEIVE(USART_WIFI, RxData);
		return;
	}
	*/
}

sint32_t uputs(USART_TypeDef * usart, sint8_t * str)
{
	if(!usart || !str) {
		return -1;
	}
	if('\0' == *str) {
		return 0;
	}
	do {
		// 检测发送完成TC标志。
		// 为了提高函数效率，此处没有使用库函数USART_GetITStatus
		while((USART1->SR&0X40)==0)
			;
		USART_SEND(usart, *str++);
	}while('\0' != *str);
	
	return 0;
}

void vLedTask(void *pvParameters)
{
	int xxx_old;
	TickType_t ms = 500;
	int init;
	

	xxx = 'a';
	xxx_old = xxx;

	while(1) {
		
		vTaskDelay(ms);
		LED2TURN();
		
		if(xxx != xxx_old) {
			xxx_old = xxx;
		}
		if(xxx == 'w') {
			if(init == 0) {
				init = 1;
				uputs(USART1, "Start WifiInit\r\n");
				BC_WifiInit();
			}
			uputs(USART1, INADDR_ANY);
			uputs(USART1, "\r\n");
		} else {
			init = 0;
			sprintf(msg, "Ansersion: %c\r\n", xxx);
			uputs(USART1, msg);
		}
		
