Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
	}
}

sint32_t BC_WifiInit(void)
{
	int i = 0;
	char * str_pos = NULL;
	TickType_t delay_time_ms = 50;
	uint8_t * tmp_ptr = NULL;
	
	// StartAcceptFlag = 0;
	// StartReceiveFlag = 0;
	
	if(BC_CreateQueue() != BC_OK) {
		uputs(USART_TERMINAL, "BC_CreateQueue: Error\r\n");
		return -1;
	}
	
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		memset(&sock_data[i], 0, sizeof(BC_SocketData));
	}
	sock_data[0].buf = SockBuf_0;
	sock_data[1].buf = SockBuf_1;
	sock_data[2].buf = SockBuf_2;
	sock_data[3].buf = SockBuf_3;
	sock_data[4].buf = SockBuf_4;

	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CWMODE=1\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CWMODE=1...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CWMODE=1: OK\r\n");
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+RST\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+RST...\r\n");
	}
	uputs(USART_TERMINAL, "AT+RST: OK\r\n");

	// SER WIFI SSID AND PASSWORD
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CWJAP=\"hb402-hb\",\"68704824\"\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CWJAP=\"hb402-hb\",\"68704824\"...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CWJAP=\"hb402-hb\",\"68704824\": OK\r\n");
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CIPMUX=1\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CIPMUX=1...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CIPMUX=1: OK\r\n");
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		sprintf(msg, "AT+CIPSERVER=1,%d\r\n", BC_CENTER_SERV_PORT);
		uputs(USART_WIFI, msg);
		vTaskDelay(delay_time_ms);
		sprintf(msg, "AT+CIPSERVER=1,%d...\r\n", BC_CENTER_SERV_PORT);
		uputs(USART_TERMINAL, msg);
	}
	sprintf(msg, "AT+CIPSERVER=1,%d: OK\r\n", BC_CENTER_SERV_PORT);
	uputs(USART_TERMINAL, msg);
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CIFSR\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CIFSR\r\n");
	}
	uputs(USART_TERMINAL, "AT+CIFSR: OK\r\n");

	tmp_ptr = usart_wifi_buf;
	str_pos = strstr(tmp_ptr, "STAIP,");
	if(!str_pos) {
		uputs(USART_TERMINAL, "Parse IP: Error\r\n");
		return -2;
	}
	tmp_ptr += strlen("STAIP,");
	tmp_ptr += 1; // at position of "
	tmp_ptr += 1; // at the first number 
	memset(INADDR_ANY, 0, 16);
	for(i = 0; i < 16;i++) {
		if('.' == tmp_ptr[i] || isdigit(tmp_ptr[i])) {
			INADDR_ANY[i] = tmp_ptr[i]; 
		} else {
			break;
		}
	}
	INADDR_ANY[i] = '\0';
	sprintf(msg, "My IP is %s\r\n", INADDR_ANY);
	uputs(USART_TERMINAL, msg);
	
	return 0;
}

sint32_t BC_CreateQueue(void)
{
	sint32_t result = BC_OK;
	
	if(!(xQueue0 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue1 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue2 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue3 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	if(!(xQueue4 = xQueueCreate(1, sizeof(BC_SocketData)))) result |= BC_ERR;
	
	return result;
}

void vTcpServerTask(void *pvParameters)
{
	BC_Sockaddr server_addr;
	BC_Sockaddr client_addr;
	sint32_t server_socket = 0;
	sint32_t client_socket;
	uint32_t addr_len = sizeof(BC_Sockaddr);
	sint32_t trans_len = 0;
	
	memset(&server_addr, 0, sizeof(BC_Sockaddr));
	server_addr.sin_family = AF_INET;
	// diff: string not long
	memcpy(server_addr.sin_addr.s_addr, INADDR_ANY, sizeof(INADDR_ANY));
	// diff: host order not net order
	server_addr.sin_port = BC_CENTER_SERV_PORT;
	
	server_socket = BC_Socket(AF_INET, SOCK_STREAM, 0);
	if(server_socket < 0) {
		printf("Error: Create socket failed\r\n");
		vTaskDelete(NULL);
		return;
	}
	if(BC_Bind(server_socket,&server_addr,sizeof(server_addr)) != 0) {
        printf("Server Bind Port : %d Failed!\r\n", server_addr.sin_port); 
        vTaskDelete(NULL);
		return;
    }
	if (BC_Listen(server_socket, LISTEN_QUEUE)) {
        printf("Server Listen Failed!\r\n"); 
        vTaskDelete(NULL);
		return;
    }
	
	while(TRUE) {
		memset(&client_addr, 0, sizeof(BC_Sockaddr));
		memset(SrvBuf, 0, TASK_BUF_SIZE);
		client_socket = BC_Accept(server_socket, &client_addr,&addr_len);
        if (client_socket < 0) {
            printf("Server Accept Failed!\r\n");
            break;
        }
		trans_len = BC_Recv(client_socket, SrvBuf, TASK_BUF_SIZE, 0);
		if(trans_len <= 0) {
			printf("Server Recv Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		printf("Recv from %s:%d\r\n", client_addr.sin_addr.s_addr, client_addr.sin_port);
		printf("Msg: #%s#\r\n", SrvBuf);
		printf("Echoing now...\r\n");
		trans_len = BC_Send(client_socket, SrvBuf, TASK_BUF_SIZE, 0);
		if(trans_len < 0) {
			printf("Server Send Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		BC_Close(client_socket);
	}
	
	BC_Close(server_socket);
	vTaskDelete(NULL);
	return;
}

sint32_t BC_Socket(sint32_t family, sint32_t type, sint32_t protocol)
{
	int i;
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		if(!sock_data[i].valid) {
			sock_data[i].valid = TRUE;
			return i;
		}
	}
	return -1;
}

sint32_t BC_Bind(sint32_t sockfd, const BC_Sockaddr * myaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!myaddr) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	memcpy(&(sock_data[sockfd].addr), myaddr, addrlen);
	return 0;
}

sint32_t BC_Listen(sint32_t sockfd, sint32_t backlog)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(backlog < 0) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	sock_data[sockfd].backlog = backlog;
	sprintf(msg, "AT+CIPSERVER=1,%d", sock_data[sockfd].addr.sin_port);
	uputs(USART_WIFI, msg);
	sprintf(msg, "Server info: IP=%s, PORT=%d\r\n", INADDR_ANY, sock_data[sockfd].addr.sin_port);
	uputs(USART1, msg);
	
